#include "uart.h"



/*********************************************/
void UartInit(void)		//9600bps@11.0592MHz
{
	SCON = 0x50;		//8位数据,可变波特率
	AUXR |= 0x01;		//串口1选择定时器2为波特率发生器
	AUXR &= 0xFB;		//定时器2时钟为Fosc/12,即12T
	T2L = 0xE8;		//设定定时初值
	T2H = 0xFF;		//设定定时初值
	AUXR |= 0x10;		//启动定时器2
}
/********************************************/
void UartSend(uchar Dat)
{
	TI = 0;
	SBUF=Dat;
	while(!TI);  
	TI=0;

}
/********************************************/
void SendString(uchar *s)
{
    while (*s)                  //检测字符串结束标志
    {
        UartSend(*s++);         //发送当前字符
    }
}
/******************************************/








































